DataProcessors/БанкИзМосквы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>БанкИзМосквы</Name>
			<Comment>С записью ошибок в журнал регистрации</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнятьРасшифровку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_НастройкиОбменаСПорталом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяКаталогаФайлаДляМосквы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентами</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщикуИзНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнкассовоеПоручениеПолученное</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеВыставленное</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.АккредитивПереданный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнкассовоеПоручениеПереданное</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолгаПоВозвратнойТаре</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.АккредитивПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеПолученное</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыОперацийПоступлениеБезналичныхДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступлениеБезналичныхДенежныхСредств</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПокупателя</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПоставщиком</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееПоступлениеБезналичныхДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриобретениеИностраннойВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступленияОтПродажиИностраннойВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОплатыПоПлатежнымКартам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОплатыПоБанковскимКредитам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>(Общ) Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
					<Comment>(Общ) Расчетная ставка НДС 18% / 118%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>(Общ) Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
					<Comment>(Общ) Расчетная ставка НДС 10% / 110%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>(Общ) Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>(Общ) Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
					<Comment>(Общ) Расчетная ставка НДС 20% / 120%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС5</Name>
					<Comment>(Общ) Ставка НДС 5%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС5_105</Name>
					<Comment>(Общ) Расчетная ставка НДС 5% / 105%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7</Name>
					<Comment>(Общ) Ставка НДС 7%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7_107</Name>
					<Comment>(Общ) Расчетная ставка НДС 7% / 107%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС22</Name>
					<Comment>(Общ) Ставка НДС 22%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС22_122</Name>
					<Comment>(Общ) Расчетная ставка НДС 22% / 122%</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыДенежныхСредств</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/БанкИзМосквы/Ext/ObjectModule.bsl
Перем Соединение Экспорт;
Функция ВыполнитьFTPПодключениеКСерверу(Знач ИмяFTPСервера) 	
	#Если Клиент Тогда
		Состояние("Выполняется подключение к FTP: " + ИмяFTPСервера);
		//		СоздатьЗаписьПротокола("Выполняется подключение к FTP: " + ИмяFTPСервера, Перечисления.бит_ОперацияОбменаСПорталом.УстановкаСоединения,Ложь);
	#КонецЕсли
	
	Попытка
		
		Соединение = Новый FTPСоединение(НастройкаОбмена.FTPАдресОбмена, НастройкаОбмена.ПортFTPСоединения, 
		НастройкаОбмена.ПользовательFTPСоединения, НастройкаОбмена.ПарольFTPСоединения, ,НастройкаОбмена.ПассивноеFTPСоединение);						
		//Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", 
		//"Buh_Samara", "<e[_Cfvfhf@2013", ,Ложь);	
	Исключение
		
		// ошибка при подключении к ftp
		//	СоздатьЗаписьПротокола("Ошибка при подключении к FTP : " + ИмяFTPСервера + " ! " + ОписаниеОшибки(), Перечисления.бит_ОперацияОбменаСПорталом.УстановкаСоединения);
		ЗаписатьОшибкуВЖурналРЕгистрации(ЭтотОбъект,"Ошибка при подключении к FTP : " + ИмяFTPСервера + " ! " + ОписаниеОшибки());
		Возврат Неопределено;
		
	КонецПопытки;
	
	//СоздатьЗаписьПротокола("Соединение установлено: " + ИмяFTPСервера, Перечисления.бит_ОперацияОбменаСПорталом.УстановкаСоединения,Ложь);
	
	Возврат Соединение;
	
КонецФункции

Функция УстановитьСоединениеСFTP(ИмяFTPСервера,ИмяКаталогаСервера) Экспорт
	
	ИмяКаталогаСервера = "";
	ИмяFTPСервера = "";
	ИмяFTPСервера    = НастройкаОбмена.FTPАдресОбмена;
	ИмяКаталогаСервера= "/"+СокрЛП(НастройкаОбмена.ПапкаФайловИзМосквы)+"/";
	Если ПустаяСтрока(ИмяFTPСервера) Тогда
		Возврат "Не задан сервер обмена информацией через FTP";
	КонецЕсли;
	
	Соединение = ВыполнитьFTPПодключениеКСерверу(ИмяFTPСервера);
	Если Соединение = Неопределено Тогда
		Возврат "Не выполнено подключение";
	КонецЕсли;
	
	НаличиеКаталога = ПроверитьНаличиеКаталогаНаFTPСервере(Соединение, ИмяКаталогаСервера);
	Если Не НаличиеКаталога Тогда 
		Возврат "Не найден каталог обмена с Москвой по имени :"+ИмяКаталогаФайлаДляМосквы;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ПроверитьНаличиеКаталогаНаFTPСервере(Соединение, Знач ИмяКаталогаСервера)
	
	Если ПустаяСтрока(ИмяКаталогаСервера) Тогда
		Возврат Истина;
	КонецЕсли;
	
	//надо сначала проверить что сам каталог доступа есть
	Попытка
		
		МассивНайденныхКаталогов = Соединение.НайтиФайлы(ИмяКаталогаСервера, "");
		
	Исключение
		Сообщить("Ошибка при соединении с FTP : " + ИмяКаталогаСервера + " ! ",СтатусСообщения.ОченьВажное);
		// ошибка при подключении к ftp
		//СоздатьЗаписьПротокола("Ошибка при соединении с FTP : " + ИмяКаталогаСервера + " ! " + ОписаниеОшибки(), Перечисления.бит_ОперацияОбменаСПорталом.УстановкаСоединения);
		Возврат Ложь;
		
	КонецПопытки;
	
	Для Каждого НайденныйКаталог Из МассивНайденныхКаталогов Цикл
		
		// если не каталог - то дальше ищем
		Если НЕ НайденныйКаталог.ЭтоКаталог() Тогда
			Продолжить;
		КонецЕсли;
		
		// большие и маленькие буквы считаются различными
		Если НайденныйКаталог.ПолноеИмя + "/" <> ИмяКаталогаСервера Тогда
			Продолжить;
		КонецЕсли;
		
		Возврат Истина;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Процедура ЗаписатьОшибкуВЖурналРЕгистрации(СсылкаОшибки,ТекстОшибки)
	ЗаписьЖурналаРегистрации("Ошибка загрузки банка из Москвы",УровеньЖурналаРегистрации.Ошибка,ЭтотОбъект.Метаданные(),СсылкаОшибки,ТекстОшибки,);
КонецПроцедуры

Функция  Сверка2() Экспорт 
	
	Перем ИмяFTPСервера, ИмяКаталогаСервера;
	
	ОшибкиПодключения = УстановитьСоединениеСFTP(ИмяFTPСервера,ИмяКаталогаСервера);
	Если ОшибкиПодключения <>"" Тогда
		ЗаписатьОшибкуВЖурналРЕгистрации(ЭтотОбъект,"Не удалось подключиться к FTP : "+ОшибкиПодключения);
		Возврат "Не удалось подключиться к FTP : "+ОшибкиПодключения;		
	КонецЕсли; 
	
	МассивНайденныхФайловНаСервере = Соединение.НайтиФайлы(ИмяКаталогаСервера, "Bank.txt");	
	Для Каждого Файл Из МассивНайденныхФайловНаСервере Цикл
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("txt");
		Попытка
			//Соединение.Получить(ИмяКаталогаСервера+"Sverka.txt", ИмяВременногоФайла);
			//Соединение.Получить(ИмяКаталогаСервера+"Sverka.txt", "C:\Sverka.txt");
			Соединение.Получить(ИмяКаталогаСервера+"Bank.txt", ИмяВременногоФайла);
			ПутьКФайлу =  ИмяВременногоФайла;
			РезультатРаботы = Сверка1();
			Возврат РезультатРаботы;
		Исключение 
			ЗаписатьОшибкуВЖурналРЕгистрации(ЭтотОбъект,"Ошибки при загрузки банка!");
			Возврат "Ошибка при копировании файла c FTP ресурса";
		КонецПопытки;
	КонецЦикла;
КонецФункции

Функция Сверка1() Экспорт 
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Дата"			,Новый ОписаниеТипов("Дата"));
	ТЗ.Колонки.Добавить("ДатаОкончания"	,Новый ОписаниеТипов("Дата"));
	ТЗ.Колонки.Добавить("Контрагент"	,Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТЗ.Колонки.Добавить("Договор"		,Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТЗ.Колонки.Добавить("Сумма"			,Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТЗ.Колонки.Добавить("НомерВх"		,Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(30)));
	ТЗ.Колонки.Добавить("ДатаВх"		,Новый ОписаниеТипов("Дата"));
	ТЗ.Колонки.Добавить("НазначениеПлатежа"		,Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(150)));
	
	
	ТекстОшибки = "";
	ДатаНачалаВыборки = КонецДня(ТекущаяДата())+1;
	ДатаОкончанияВыборки = Дата(1,1,1);
	
	Текст = Новый ТекстовыйДокумент; 
	Текст.Прочитать(ПутьКФайлу);
	Для НомерСтроки = 1 По Текст.КоличествоСтрок() Цикл 
		
		Стр = Текст.ПолучитьСтроку(НомерСтроки); 
		Номерсобаки = Найти(Стр, "@"); 
		СтрокаДляАнализа = Лев(Стр, Номерсобаки - 1);
		ДатаДокумента = ПолучитьДату(СтрокаДляАнализа,Истина); 
		ДатаНачалаВыборки = Мин(ДатаНачалаВыборки, ДатаДокумента);
		ДатаОкончанияВыборки = Макс(ДатаОкончанияВыборки, КонецДня(ДатаДокумента));
		
		Стр = сред(Стр ,   Номерсобаки + 1);
		Номерсобаки = Найти(Стр, "@"); 
		КодКонтрагента = Лев(Стр, Номерсобаки - 1); 
		
		Стр   = сред(Стр ,   Номерсобаки + 1);
		Номерсобаки = Найти(Стр, "@"); 
		КодДоговора= Лев(Стр, Номерсобаки - 1); 
		
		Стр   = сред(Стр ,   Номерсобаки + 1);
		Номерсобаки = Найти(Стр, "@"); 
		СуммаПлатежа= Число(Лев(Стр, Номерсобаки - 1)); 
		
		Стр   = сред(Стр ,   Номерсобаки + 1);
		Номерсобаки = Найти(Стр, "@"); 
		НомерВх= Лев(Стр ,   Номерсобаки - 1); 
		
		СтрокаДляАнализа = сред(Стр ,Номерсобаки + 1);
		Номерсобаки = Найти(СтрокаДляАнализа, "@"); 
		Если  Номерсобаки  = 0 Тогда 
			ДатаВх = ПолучитьДату(СтрокаДляАнализа,Истина);
			НазначениеПлатежа = "";
		Иначе 
			ДатаВх = ПолучитьДату(Лев(СтрокаДляАнализа,Номерсобаки - 1),Истина);
			НазначениеПлатежа = сред(СтрокаДляАнализа ,Номерсобаки + 1);
		КонецЕсли;
	
		
		
		Контрагент = Справочники.Контрагенты.НайтиПоКоду(КодКонтрагента);
		Если Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
			ТекстОшибки = ТекстОшибки+"В строке "+НомерСтроки+" не найден контрагент с кодом "+ КодКонтрагента+Символы.ПС;
			ЗаписатьОшибкуВЖурналРЕгистрации(ЭтотОбъект,"В строке "+НомерСтроки+" не найден контрагент с кодом "+ КодКонтрагента);
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Контрагент.ОсновнойДоговорКонтрагента) И Контрагент.ОсновнойДоговорКонтрагента.Организация = Организация Тогда 
			Договор = Контрагент.ОсновнойДоговорКонтрагента;
		Иначе
			Если КодДоговора = "" Тогда 
				ТекстОшибки = ТекстОшибки+"В строке "+НомерСтроки+" не указан код договора. Не найдено подходящего договора для контрагента "+Контрагент.Наименование+"( КОД : "+Контрагент.Код+" )"+Символы.ПС;
				ЗаписатьОшибкуВЖурналРЕгистрации(ЭтотОбъект,"В строке "+НомерСтроки+" не указан код договора. Не найдено подходящего договора для контрагента "+Контрагент.Наименование+"( КОД : "+Контрагент.Код+" )");
				Продолжить;
			Иначе
				Договор  = Справочники.ДоговорыКонтрагентов.НайтиПоКоду(КодДоговора,,,Контрагент.Ссылка);
				Если Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка() Тогда
					ТекстОшибки = ТекстОшибки+"В строке "+НомерСтроки+" не найден договор с кодом "+КодДоговора+" для контрагента "+Контрагент+Символы.ПС;
					ЗаписатьОшибкуВЖурналРЕгистрации(ЭтотОбъект,"В строке "+НомерСтроки+" не найден договор с кодом "+КодДоговора+" для контрагента "+Контрагент);
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтрокаТЗ = ТЗ.Добавить();
		НоваяСтрокаТЗ.Дата 		= ДатаДокумента;
		НоваяСтрокаТЗ.ДатаОкончания= КонецДня(ДатаДокумента);
		НоваяСтрокаТЗ.Контрагент= Контрагент;
		НоваяСтрокаТЗ.Договор   = Договор;
		НоваяСтрокаТЗ.Сумма  	= СуммаПлатежа;
		НоваяСтрокаТЗ.НомерВх  	= НомерВх;
		НоваяСтрокаТЗ.ДатаВх  	= ДатаВх;
		НоваяСтрокаТЗ.НазначениеПлатежа  	= НазначениеПлатежа;
		
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗ.Дата КАК Дата,
	|	ТЗ.ДатаОкончания КАК ДатаОкончания,
	|	ТЗ.Контрагент КАК Контрагент,
	|	ТЗ.Договор КАК Договор,
	|	ТЗ.Сумма КАК Сумма,
	|	ТЗ.НомерВх КАК НомерВх,
	|	ТЗ.ДатаВх КАК ДатаВх,
	|	ТЗ.НазначениеПлатежа
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗ.Дата,
	|	ТЗ.ДатаОкончания,
	|	ТЗ.Контрагент,
	|	ТЗ.Договор,
	|	ТЗ.Сумма,
	|	ТЗ.НомерВх,
	|	ТЗ.ДатаВх,
	|	ТЗ.НазначениеПлатежа
	|ПОМЕСТИТЬ ТЗГрупп
	|ИЗ
	|	ТЗ КАК ТЗ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЗ.Дата,
	|	ТЗ.ДатаОкончания,
	|	ТЗ.Контрагент,
	|	ТЗ.Сумма,
	|	ТЗ.ДатаВх,
	|	ТЗ.Договор,
	|	ТЗ.НомерВх,
	|	ТЗ.НазначениеПлатежа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗГрупп.Дата,
	|	ТЗГрупп.Контрагент,
	|	ТЗГрупп.Договор,
	|	ТЗГрупп.Сумма,
	|	ТЗГрупп.НомерВх,
	|	ТЗГрупп.ДатаВх,
	|	ЕСТЬNULL(ПлатежноеПоручениеВходящее.Ссылка, ЗНАЧЕНИЕ(Документ.ПлатежноеПоручениеВходящее.ПустаяСсылка)) КАК ПлатежноеПоручениеВходящее,
	|	ТЗГрупп.НазначениеПлатежа
	|ПОМЕСТИТЬ Итоговая
	|ИЗ
	|	ТЗГрупп КАК ТЗГрупп
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручениеВходящее КАК ПлатежноеПоручениеВходящее
	|		ПО ТЗГрупп.Контрагент = ПлатежноеПоручениеВходящее.Контрагент
	|			И ТЗГрупп.Дата <= ПлатежноеПоручениеВходящее.Дата
	|			И ТЗГрупп.ДатаОкончания >= ПлатежноеПоручениеВходящее.Дата
	|			И ТЗГрупп.Договор = ПлатежноеПоручениеВходящее.ДоговорКонтрагента
	|			И ТЗГрупп.НомерВх = ПлатежноеПоручениеВходящее.НомерВходящегоДокумента
	|			И ТЗГрупп.ДатаВх = ПлатежноеПоручениеВходящее.ДатаВходящегоДокумента
	|			И (ПлатежноеПоручениеВходящее.СозданРуками)
	|			И (ПлатежноеПоручениеВходящее.Проведен)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итоговая.Дата,
	|	Итоговая.Контрагент,
	|	Итоговая.Договор,
	|	Итоговая.Сумма,
	|	Итоговая.НомерВх,
	|	Итоговая.ДатаВх,
	|	Итоговая.ПлатежноеПоручениеВходящее,
	|	Итоговая.НазначениеПлатежа
	|ИЗ
	|	Итоговая КАК Итоговая
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПлатежноеПоручениеВходящее.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПлатежноеПоручениеВходящее КАК ПлатежноеПоручениеВходящее
	|ГДЕ
	|	НЕ ПлатежноеПоручениеВходящее.ПометкаУдаления
	|	И ПлатежноеПоручениеВходящее.Дата >= &ДатаНачалаВыборки
	|	И ПлатежноеПоручениеВходящее.Дата <= &ДатаОкончанияВыборки
	|	И ПлатежноеПоручениеВходящее.СозданРуками
	|	И НЕ ПлатежноеПоручениеВходящее.Ссылка В
	|					(ВЫБРАТЬ
	|						Итоговая.ПлатежноеПоручениеВходящее
	|					ИЗ
	|						Итоговая КАК Итоговая)
	|			И ПлатежноеПоручениеВходящее.Контрагент.БезналичныеПлатежиИзУТ11НеПереносятсяРегламентнымЗаданием = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	Запрос.УстановитьПараметр("ДатаНачалаВыборки", ДатаНачалаВыборки);
	Запрос.УстановитьПараметр("ДатаОкончанияВыборки", ДатаОкончанияВыборки);
	Результат = Запрос.ВыполнитьПакет();
	
	БылВывод = Ложь;
	
	ДокументыКИзменению = Результат[3].Выгрузить();
	ДокументыКУдалению = Результат[4].Выгрузить();
	Попытка
		ПараметрыСеанса.ГраницыЗапретаИзмененияДанных = Новый ХранилищеЗначения(Неопределено, Новый СжатиеДанных(0));
	Исключение
		ЗаписатьОшибкуВЖурналРЕгистрации(ЭтотОбъект,"Не удалось сдвинуть границу запрета изменения данных . Начало процедуры");
	КонецПопытки;
	
	Для каждого Стр Из ДокументыКУдалению Цикл
		ТекущийОбъект = Стр.Ссылка.ПолучитьОбъект();
		Попытка
			ТекущийОбъект.УстановитьПометкуУдаления(Истина);
			Если Не БылВывод тогда
				БылВывод = Истина;
				
				ЗаписатьОшибкуВЖурналРЕгистрации(ЭтотОбъект,Текст.ПолучитьТекст());
				
			КонецЕсли;
		Исключение
			ЗаписатьОшибкуВЖурналРЕгистрации(ТекущийОбъект.Ссылка,"Пометка на удаление документа "+ОписаниеОшибки());
		КонецПопытки; 		
	КонецЦикла;

	
	//Для каждого ТекСтр Из ДокументыКИзменению Цикл
	//	
	//	Если ЗначениеЗаполнено(ТекСтр.ПлатежноеПоручениеВходящее) Тогда 
	//		НовыйДокумент = ТекСтр.ПлатежноеПоручениеВходящее.ПолучитьОбъект();
	//		Если НовыйДокумент.Проведен Тогда
	//			Попытка
	//				НовыйДокумент.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	//			Исключение
	//				ЗаписатьОшибкуВЖурналРЕгистрации(НовыйДокумент.Ссылка,"Отмена проведения документа "+ОписаниеОшибки());
	//			КонецПопытки; 
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	
	Для каждого ТекСтр Из ДокументыКИзменению Цикл
		
		Если ЗначениеЗаполнено(ТекСтр.ПлатежноеПоручениеВходящее) Тогда 
			НовыйДокумент = ТекСтр.ПлатежноеПоручениеВходящее.ПолучитьОбъект();
			ЭтоНовыйДокумент = Ложь;
		Иначе
			НовыйДокумент = Документы.ПлатежноеПоручениеВходящее.СоздатьДокумент();
			ЭтоНовыйДокумент = Истина;
		КонецЕсли;
		
		НовыйДокумент.РасшифровкаПлатежа.Очистить();
		
		НовыйДокумент.Дата 					= КонецДня(ТекСтр.Дата);
		НовыйДокумент.Организация 			= Организация;
		НовыйДокумент.ОтраженоВОперУчете 	= Истина;
		НовыйДокумент.Контрагент 			=  ТекСтр.Контрагент;
		НовыйДокумент.ДоговорКонтрагента 	=  ТекСтр.Договор;
		НовыйДокумент.Оплачено 				= Истина;
		НовыйДокумент.ВалютаДокумента 		= Константы.ВалютаРегламентированногоУчета.Получить();
		НовыйДокумент.КурсДокумента 		= 1;
		НовыйДокумент.КратностьДокумента 	= 1;
		НовыйДокумент.Ответственный 		= ПараметрыСеанса.ТекущийПользователь;
		НовыйДокумент.ДатаОплаты 			= НовыйДокумент.Дата;
		НовыйДокумент.ВидОперации 			= Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ОплатаПокупателя;
		НовыйДокумент.СчетОрганизации 		= Организация.ОсновнойБанковскийСчет;
		НовыйДокумент.СуммаДокумента 		= ТекСтр.Сумма;
		НовыйДокумент.СозданРуками 			= Истина;
		НовыйДокумент.НомерВходящегоДокумента = ТекСтр.НомерВх;
		НовыйДокумент.НазначениеПлатежа = ТекСтр.НазначениеПлатежа ;
		Если Не ПустаяСтрока(ТекСтр.ДатаВх) Тогда 
			НовыйДокумент.ДатаВходящегоДокумента = ТекСтр.ДатаВх;
		Иначе 
			НовыйДокумент.ДатаВходящегоДокумента = НовыйДокумент.Дата;
		КонецЕсли;
		
		Если НЕ ЗаполнятьРасшифровку  ИЛи НЕ ТекСтр.договор.ВестиПоДокументамРасчетовСКонтрагентом Тогда 
			НоваяСтрокаТЧ = НовыйДокумент.РасшифровкаПлатежа.Добавить();
			НоваяСтрокаТЧ.ДоговорКонтрагента 	= ТекСтр.Договор;
			НоваяСтрокаТЧ.СуммаПлатежа 			= ТекСтр.Сумма;
			НоваяСтрокаТЧ.СуммаВзаиморасчетов 	= ТекСтр.Сумма; 
			//+Гавриленков В. 10.12.2025 #UT10-5574
			//НоваяСтрокаТЧ.СтавкаНДС  			= ?(НовыйДокумент.Дата>= Дата("20190101000000"),Перечисления.СтавкиНДС.НДС20,Перечисления.СтавкиНДС.НДС18);
			НоваяСтрокаТЧ.СтавкаНДС  			= ?(НовыйДокумент.Дата >= Дата("20260101000000"), Перечисления.СтавкиНДС.НДС22, ?(НовыйДокумент.Дата >= Дата("20190101000000"), Перечисления.СтавкиНДС.НДС20, Перечисления.СтавкиНДС.НДС18));
			//ЗначениеСтавкиНДС = ?(НоваяСтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.НДС18,18,20); 
			ЗначениеСтавкиНДС = УчетНДС.ПолучитьСтавкуНДС(НоваяСтрокаТЧ.СтавкаНДС);
			//-Гавриленков В. 10.12.2025 #UT10-5574
			НоваяСтрокаТЧ.СуммаНДС  			= НоваяСтрокаТЧ.СуммаПлатежа*ЗначениеСтавкиНДС/(100+ЗначениеСтавкиНДС);
			НоваяСтрокаТЧ.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПокупателя;
			НоваяСтрокаТЧ.КурсВзаиморасчетов 	= 1;
			НоваяСтрокаТЧ.КратностьВзаиморасчетов = 1;				
			
		ИначеЕсли  ЗаполнятьРасшифровку  Тогда 
			
			Если ЗначениеЗаполнено(ТекСтр.Договор)  
				И ТекСтр.Договор.ВестиПоДокументамРасчетовСКонтрагентом Тогда 
				
				НовыйДокумент.РасшифровкаПлатежа.Очистить();
				
				СтруктураПараметров = Новый Структура;
				
				СтруктураПараметров.Вставить("Организация"					,НовыйДокумент.Организация);
				СтруктураПараметров.Вставить("Контрагент"					,НовыйДокумент.Контрагент);
				СтруктураПараметров.Вставить("ВалютаДокумента"				,НовыйДокумент.ВалютаДокумента);
				СтруктураПараметров.Вставить("СуммаДокумента"				,НовыйДокумент.СуммаДокумента);
				//%%%КЮ(нач)
				Если ЭтоНовыйДокумент Тогда 
					СтруктураПараметров.Вставить("ДатаДок"						,НовыйДокумент.Дата);
				Иначе 
					СтруктураПараметров.Вставить("ДатаДок"						,НовыйДокумент.Дата - 1);
				КонецЕсли;
			
				//%%%КЮ(кон)
				СтруктураПараметров.Вставить("ВидОперацииДок"				,НовыйДокумент.ВидОперации);
				СтруктураПараметров.Вставить("РасшифровкаПлатежа"			,НовыйДокумент.РасшифровкаПлатежа);
				СтруктураПараметров.Вставить("КурсДокумента"				,1);
				СтруктураПараметров.Вставить("КратностьДокумента"			,1);
				СтруктураПараметров.Вставить("ТипЗадолженности"				,">0");
				СтруктураПараметров.Вставить("Интерактивно"					,Ложь);
				СтруктураПараметров.Вставить("ПлатежПоСуммеВзаиморасчетов"	,Ложь);
				
				СтруктураПараметровАвто = Новый Структура;
				СтруктураПараметровАвто.Вставить("УчитыватьФактическиеЗадолженности" ,Истина);
				СтруктураПараметровАвто.Вставить("УчитыватьОперативныеЗадолженности" ,Ложь);
				СтруктураПараметровАвто.Вставить("ПодбиратьСумму"			    ,Истина);
				СтруктураПараметровАвто.Вставить("ПодборПоСуммеПлатежа"			,Истина);
				СтруктураПараметровАвто.Вставить("СуммаДляПодбора"			    ,НовыйДокумент.СуммаДокумента);
				СтруктураПараметровАвто.Вставить("СпособЗаполнения"			    ,"ФИФО");
				СтруктураПараметровАвто.Вставить("ПоЗаявкам"				    ,Ложь);
				СтруктураПараметровАвто.Вставить("ПодбиратьПланируемыеДвижения"	,Ложь);
				СтруктураПараметровАвто.Вставить("НеПревышатьЗапланированныхЗначений",Ложь);
				СтруктураПараметровАвто.Вставить("ВключенныеВПлатежныйКалендарь",Ложь);
				
				//отбор по конкретному договору 
				Построитель = Новый ПостроительОтчета;
				Построитель.Текст = "ВЫБРАТЬ
				|    ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента,
				|    ВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток,
				|    ВзаиморасчетыСКонтрагентамиОстатки.СуммаУпрОстаток
				|ИЗ
				|    РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(, Контрагент = &Контрагент {(ДоговорКонтрагента).*}) КАК ВзаиморасчетыСКонтрагентамиОстатки";    
				
				ПолеДоговора = Построитель.Отбор.Добавить("ДоговорКонтрагента");
				ПолеДоговора.ВидСравнения = ВидСравнения.Равно;
				ПолеДоговора.Использование = Истина;
				ПолеДоговора.Значение = ТекСтр.Договор;
				ОтборПоДоговорам = Построитель.ПолучитьНастройки();
				
				СтруктураПараметровАвто.Вставить("ОтборПоДоговорам", ОтборПоДоговорам);		
				//**
				
				СтруктураПараметров.Вставить("СтруктураПараметровАвто"		,СтруктураПараметровАвто);
				СтруктураПараметров.Вставить("ФормаОплаты"					,Перечисления.ВидыДенежныхСредств.Безналичные);
				СтруктураПараметров.Вставить("ВидОперацииПлан"				,УправлениеДенежнымиСредствами.ОпределитьВидОперацииПлан(НовыйДокумент.ВидОперации));
				СтруктураПараметров.Вставить("ИмяРегистраПлан"				,"ЗаявкиНаРасходованиеСредств");
				СтруктураПараметров.Вставить("БанковскийСчетКасса"			,НовыйДокумент.СчетОрганизации);
				СтруктураПараметров.Вставить("СсылкаНаДокумент"				,?(НовыйДокумент.Проведен, НовыйДокумент.Ссылка, НовыйДокумент));
				
				УправлениеДенежнымиСредствами.ЗаполнитьРасшифровкуПлатежей(СтруктураПараметров);
				
				Для Каждого СтрокаДокумента Из НовыйДокумент.РасшифровкаПлатежа   Цикл
					
					//+Гавриленков В. 10.12.2025 #UT10-5574
					//СтрокаДокумента.СтавкаНДС= ?(НовыйДокумент.Дата>= Дата("20190101000000"),Перечисления.СтавкиНДС.НДС20,Перечисления.СтавкиНДС.НДС18);
					СтрокаДокумента.СтавкаНДС = ?(НовыйДокумент.Дата >= Дата("20260101000000"), Перечисления.СтавкиНДС.НДС22, ?(НовыйДокумент.Дата >= Дата("20190101000000"), Перечисления.СтавкиНДС.НДС20,Перечисления.СтавкиНДС.НДС18));
					//-Гавриленков В. 10.12.2025 #UT10-5574
					УправлениеДенежнымиСредствами.ЗаполнитьРеквизитыРеглУчета(НовыйДокумент.Ссылка,СтрокаДокумента,СтрокаДокумента.СтавкаНДС);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);		
		Попытка
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ЗаписатьОшибкуВЖурналРЕгистрации(НовыйДокумент.Ссылка,"Проведение документа "+ОписаниеОшибки());
		КонецПопытки; 		
	КонецЦикла;
	
	
	Попытка
		ПолныеПрава.УстановитьПараметрГраницыЗапретаИзмененияДанных();  
	Исключение
		ЗаписатьОшибкуВЖурналРЕгистрации(ЭтотОбъект,"Не удалось сдвинуть границу запрета изменения данных . Конец процедуры");
	КонецПопытки;

	
	Возврат ТекстОшибки;
	
КонецФункции
//
Функция  ПолучитьДату(ДатаИзДрБазы,НачалоДня = Ложь)
	
	НомерТочки = Найти(ДатаИзДрБазы,".");
	Число_ = Число(Лев(ДатаИзДрБазы,НомерТочки-1));
	
	ДатаИзДрБазы   = Сред(ДатаИзДрБазы,  НомерТочки+1);
	НомерТочки = Найти(ДатаИзДрБазы,".");
	Месяц = Число(Лев(ДатаИзДрБазы,НомерТочки-1));
	
	Год = Число(Сред(ДатаИзДрБазы,  НомерТочки+1));
	
	Если НачалоДня Тогда 
		Возврат НачалоДня(Дата(Год,Месяц,Число_));
	Иначе
		Возврат КонецДня(Дата(Год,Месяц,Число_));
	КонецЕсли;
	
КонецФункции

Функция ВыполнитьЗагрузкуБанкаИзМосквы() Экспорт	
	Возврат Сверка2();
КонецФункции
